-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\BoonHan\Dropbox\University\Research\Projects\Beliefs-BSR_QSR\STATA\1804-BSR_QSR\Paper\Logs\permutation_tests-part1.log
  log type:  text
 opened on:  21 Aug 2020, 16:03:07

. 
. set seed 1234

. program drop _all

. program CompareMeanDist, rclass
  1. summarize Dist if Treat==1
  2. scalar Mean1 = r(mean)
  3. summarize Dist if Treat==2
  4. scalar Mean2 = r(mean)
  5. return scalar DiffMean = Mean2-Mean1
  6. end

. program CompareMeanError, rclass
  1. summarize Error if Treat==1
  2. scalar Mean1 = r(mean)
  3. summarize Error if Treat==2
  4. scalar Mean2 = r(mean)
  5. return scalar DiffMean = Mean2-Mean1
  6. end

. 
. // Prior = Not 0.50
. use "Data\belief_elicitation-paper-long.dta", clear

. keep if PriorDist!=0
(240 observations deleted)

. display "******************************"
******************************

. display "Prior = Not 0.50"
Prior = Not 0.50

. display "******************************"
******************************

. 
. egen IDTemp=group(ID mechB)

. order IDTemp, first

. collapse (mean) ID RiskPref Dist Error mechB mechQ orderBQ orderQB Exp, by(IDTemp)

. gen Treat=.
(240 missing values generated)

. 
. display "Note: DiffMean = Mean(Treat=2) - Mean(Treat=1)"
Note: DiffMean = Mean(Treat=2) - Mean(Treat=1)

. 
.         * mech-B vs. mech-Q (Part 1)
.         
.         set seed 1234

.         local r=500000 // paper uses 500000 reps

.         preserve

.         keep if Exp==1
(120 observations deleted)

.         replace Treat=.
(0 real changes made)

.         display "Part 1:"
Part 1:

.         replace Treat=1 if mechB==1
(60 real changes made)

.         replace Treat=2 if mechQ==1
(60 real changes made)

.         display "DIST"
DIST

.         permute Treat Diff12=r(DiffMean), reps(`r') nodrop nodots nowarn: CompareMeanDist

Monte Carlo permutation results           Number of observations  =         120
                                          Number of permutations  =     500,000

      command:  CompareMeanDist
       Diff12:  r(DiffMean)
  permute var:  Treat

-------------------------------------------------------------------------------
             |                                               Monte Carlo error
             |                                              -------------------
           T |    T(obs)       Test       c       n      p  SE(p)   [95% CI(p)]
-------------+-----------------------------------------------------------------
      Diff12 | -.0179583      lower   75803  500000  .1516  .0005  .1506  .1526
             |                upper  424816  500000  .8496  .0005  .8486  .8506
             |            two-sided                  .3032  .0007  .3019  .3045
-------------------------------------------------------------------------------
Note: For lower one-sided test, c = #{T <= T(obs)} and p = p_lower = c/n.
Note: For upper one-sided test, c = #{T >= T(obs)} and p = p_upper = c/n.
Note: For two-sided test, p = 2*min(p_lower, p_upper); SE and CI approximate.

.         display "NAD"
NAD

.         permute Treat Diff12=r(DiffMean), reps(`r') nodrop nodots nowarn: CompareMeanError

Monte Carlo permutation results           Number of observations  =         120
                                          Number of permutations  =     500,000

      command:  CompareMeanError
       Diff12:  r(DiffMean)
  permute var:  Treat

-------------------------------------------------------------------------------
             |                                               Monte Carlo error
             |                                              -------------------
           T |    T(obs)       Test       c       n      p  SE(p)   [95% CI(p)]
-------------+-----------------------------------------------------------------
      Diff12 |  -.029125      lower   12768  500000  .0255  .0002  .0251  .0260
             |                upper  487401  500000  .9748  .0002  .9744  .9752
             |            two-sided                  .0511  .0003  .0505  .0517
-------------------------------------------------------------------------------
Note: For lower one-sided test, c = #{T <= T(obs)} and p = p_lower = c/n.
Note: For upper one-sided test, c = #{T >= T(obs)} and p = p_upper = c/n.
Note: For two-sided test, p = 2*min(p_lower, p_upper); SE and CI approximate.

.         replace Treat=.
(120 real changes made, 120 to missing)

.         restore

.         
. 
. // Prior = 0.50
. use "Data\belief_elicitation-paper-long.dta", clear

. keep if PriorDist==0
(960 observations deleted)

. display "******************************"
******************************

. display "Prior = 0.50"
Prior = 0.50

. display "******************************"
******************************

. 
. egen IDTemp=group(ID mechB)

. order IDTemp, first

. collapse (mean) ID RiskPref Dist Error mechB mechQ orderBQ orderQB Exp, by(IDTemp)

. gen Treat=.
(240 missing values generated)

. 
. display "Note: DiffMean = Mean(Treat=2) - Mean(Treat=1)"
Note: DiffMean = Mean(Treat=2) - Mean(Treat=1)

. 
.         * mech-B vs. mech-Q (Part 1)
.         
.         set seed 1234

.         local r=500000 // paper uses 500000 reps

.         preserve

.         keep if Exp==1
(120 observations deleted)

.         replace Treat=.
(0 real changes made)

.         display "Part 1"
Part 1

.         replace Treat=1 if mechB==1
(60 real changes made)

.         replace Treat=2 if mechQ==1
(60 real changes made)

.         display "DIST"
DIST

.         permute Treat Diff12=r(DiffMean), reps(`r') nodrop nodots nowarn: CompareMeanDist

Monte Carlo permutation results           Number of observations  =         120
                                          Number of permutations  =     500,000

      command:  CompareMeanDist
       Diff12:  r(DiffMean)
  permute var:  Treat

-------------------------------------------------------------------------------
             |                                               Monte Carlo error
             |                                              -------------------
           T |    T(obs)       Test       c       n      p  SE(p)   [95% CI(p)]
-------------+-----------------------------------------------------------------
      Diff12 | -.0183333      lower   49367  500000  .0987  .0004  .0979  .0996
             |                upper  452670  500000  .9053  .0004  .9045  .9062
             |            two-sided                  .1975  .0006  .1964  .1986
-------------------------------------------------------------------------------
Note: For lower one-sided test, c = #{T <= T(obs)} and p = p_lower = c/n.
Note: For upper one-sided test, c = #{T >= T(obs)} and p = p_upper = c/n.
Note: For two-sided test, p = 2*min(p_lower, p_upper); SE and CI approximate.

.         replace Treat=.
(120 real changes made, 120 to missing)

.         restore

.         
. capture log close _all
